app/controllers/events_controller.rb

SELECT * FROM "events"
---
  def index
    @events = Event.all

SELECT * FROM "events" WHERE ("events"."id" = 1)
SELECT * FROM "vendors" WHERE ("vendors"."id" = 1)
---
  def show
    @event = Event.find(params[:id])

    @expense = Expense.new
    @vendors = Vendor.find(:all, :order => 'name')

SELECT * FROM "events" WHERE ("events"."id" = 1)
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO "events" ("name", "updated_at", "budget", "created_at") VALUES('test', '2009-06-16 14:44:54', 1.0, '2009-06-16 14:44:54')
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT * FROM "events" WHERE ("events"."id" = 1)
DELETE FROM "events" WHERE "id" = 1
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy