app/controllers/expenses_controller.rb

SELECT * FROM "events" WHERE ("events"."id" = 2)
INSERT INTO "expenses" ("event_id", "vendor_id", "updated_at", "amount", "created_at") VALUES(2, 1, '2009-06-17 15:07:36', 20.0, '2009-06-17 15:07:36')
---
  def create
    @event = Event.find(params[:event_id])
    @expense = @event.expenses.build(params[:expense])

    respond_to do |format|
      if @expense.save

SELECT * FROM "events" WHERE ("events"."id" = 2)
SELECT * FROM "expenses" WHERE ("expenses"."id" = 4 AND ("expenses".event_id = 2))
SELECT sum("expenses".amount) AS sum_amount FROM "expenses" WHERE ("expenses".event_id = 2)
DELETE FROM "expenses" WHERE "id" = 4
---
  def destroy
    @event   = Event.find(params[:event_id])
    @expense = @event.expenses.find(params[:id])

    @expense.destroy